Revit 2027 API
StructuralSettings.KickerBraceSymbol Property
 The id of the ElementType to represent a kicker brace.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId KickerBraceSymbol { get; set; }
Public Property KickerBraceSymbol As ElementId
	Get
	Set
public:
property ElementId^ KickerBraceSymbol {
	ElementId^ get ();
	void set (ElementId^ value);
}
member KickerBraceSymbol : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace